In [16]:
import pymysql
import pandas as pd
from sqlalchemy import create_engine
pymysql.install_as_MySQLdb()

In [4]:
filename = 'https://datasets.imdbws.com/name.basics.tsv.gz'
df = pd.read_csv(filename, sep='\t', low_memory=False)

df.head()

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,nm0000001,Fred Astaire,1899,1987,"soundtrack,actor,miscellaneous","tt0053137,tt0072308,tt0031983,tt0050419"
1,nm0000002,Lauren Bacall,1924,2014,"actress,soundtrack","tt0071877,tt0117057,tt0037382,tt0038355"
2,nm0000003,Brigitte Bardot,1934,\N,"actress,soundtrack,music_department","tt0054452,tt0049189,tt0056404,tt0057345"
3,nm0000004,John Belushi,1949,1982,"actor,soundtrack,writer","tt0080455,tt0078723,tt0072562,tt0077975"
4,nm0000005,Ingmar Bergman,1918,2007,"writer,director,actor","tt0083922,tt0050986,tt0060827,tt0050976"

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12074454 entries, 0 to 12074453
Data columns (total 6 columns):
 #   Column             Dtype
---  ------             -----
 0   nconst             object
 1   primaryName        object
 2   birthYear          object
 3   deathYear          object
 4   primaryProfession  object
 5   knownForTitles     object
dtypes: object(6)
memory usage: 552.7+ MB

In [6]:
df.isna().sum()

nconst                     0
primaryName                1
birthYear                  0
deathYear                  0
primaryProfession    2609606
knownForTitles             0
dtype: int64

In [7]:
df.dropna(inplace=True)

In [23]:
df.loc[(df['birthYear'] >= '2000')]

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
82,nm0000083,Alan Miller,\N,\N,"editor,writer,director","tt0320978,tt19064180,tt0969216,tt0424773"
93,nm0000094,J. Reifel,\N,\N,writer,"tt0118631,tt0116030,tt0117915,tt0118886"
646,nm0000647,Alan Smithee,\N,\N,"director,actor,writer","tt2076794,tt0096875,tt0118577,tt4591238"
711,nm0000712,Steve Cohen,\N,\N,"assistant_director,director,miscellaneous","tt0089218,tt0363685,tt0143213,tt0098844"
1267,nm0001269,Cynthia Gibb,\N,\N,"actress,soundtrack","tt0107065,tt0096101,tt0091886,tt0083412"
...,...,...,...,...,...,...
12074444,nm9993709,Lu Bevins,\N,\N,"producer,director,writer","tt11697102,tt11772812,tt11772904,tt17717854"
12074448,nm9993713,Sambit Mishra,\N,\N,"writer,producer","tt10709066,tt15134202,tt21147342,tt10449366"
12074449,nm9993714,Romeo del Rosario,\N,\N,"animation_department,art_department","tt11657662,tt14069590,tt2455546"
12074451,nm9993717,Harikrishnan Rajan,\N,\N,cinematographer,tt8736744
12074452,nm9993718,Aayush Nair,\N,\N,cinematographer,\N

In [24]:
file_2 = 'https://datasets.imdbws.com/title.ratings.tsv.gz'

df_2 = pd.read_csv(file_2 , sep='\t' , low_memory=False)

df_2.head(10)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1922
1  tt0000002            5.8       259
2  tt0000003            6.5      1734
3  tt0000004            5.6       174
4  tt0000005            6.2      2546
5  tt0000006            5.1       175
6  tt0000007            5.4       797
7  tt0000008            5.4      2064
8  tt0000009            5.2       200
9  tt0000010            6.9      6966

In [25]:
df_2.dropna(inplace=True)

In [26]:
file_3 = 'https://datasets.imdbws.com/title.akas.tsv.gz'

df_3 = pd.read_csv(file_3, sep='\t', low_memory=False)

df_3.head(10)

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,1,Карменсіта,UA,\N,imdbDisplay,\N,0
1,tt0000001,2,Carmencita,DE,\N,\N,literal title,0
2,tt0000001,3,Carmencita - spanyol tánc,HU,\N,imdbDisplay,\N,0
3,tt0000001,4,Καρμενσίτα,GR,\N,imdbDisplay,\N,0
4,tt0000001,5,Карменсита,RU,\N,imdbDisplay,\N,0
5,tt0000001,6,Carmencita,US,\N,imdbDisplay,\N,0
6,tt0000001,7,Carmencita,\N,\N,original,\N,1
7,tt0000001,8,カルメンチータ,JP,ja,imdbDisplay,\N,0
8,tt0000002,1,Le clown et ses chiens,\N,\N,original,\N,1
9,tt0000002,2,Le clown et ses chiens,FR,\N,imdbDisplay,\N,0

In [27]:
df_3.isna().sum()

titleId              0
ordering             0
title                5
region             105
language             0
types                0
attributes           0
isOriginalTitle      0
dtype: int64

In [28]:
df_3.dropna(inplace=True)

In [29]:
df_3.loc[(df_3['region'] == 'US')]

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
5,tt0000001,6,Carmencita,US,\N,imdbDisplay,\N,0
14,tt0000002,7,The Clown and His Dogs,US,\N,\N,literal English title,0
33,tt0000005,10,Blacksmith Scene,US,\N,imdbDisplay,\N,0
36,tt0000005,1,Blacksmithing Scene,US,\N,alternative,\N,0
41,tt0000005,6,Blacksmith Scene #1,US,\N,alternative,\N,0
...,...,...,...,...,...,...,...,...
33799531,tt9916702,1,Loving London: The Playground,US,\N,\N,\N,0
33799568,tt9916720,10,The Demonic Nun,US,\N,tv,\N,0
33799570,tt9916720,12,The Nun 2,US,\N,imdbDisplay,\N,0
33799587,tt9916756,1,Pretty Pretty Black Girl,US,\N,imdbDisplay,\N,0
33799603,tt9916764,1,38,US,\N,imdbDisplay,\N,0